In [1]:
# connect to postgresql database called imdb_pg with user postgres and password postgres
import psycopg2
conn = psycopg2.connect("dbname=imdb_pg user=postgres password=postgres")

# get an inventory of the tables
cur = conn.cursor()
cur.execute("SELECT table_name FROM information_schema.tables WHERE table_schema = 'public'")
for table in cur.fetchall():
    print(table)

('title_akas',)
('name_basics',)
('title_episode',)
('title_principals',)
('title_basics',)
('title_ratings',)
('title_crew',)

In [2]:
import pandas as pd
# go over name_basics
pd.read_sql_query("SELECT * FROM name_basics LIMIT 5;", conn)

C:\Users\Dave\AppData\Local\Temp\ipykernel_4324\2721742186.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM name_basics LIMIT 5;", conn)

,nconst,primaryname,birthyear,deathyear,primaryprofession,knownfortitles
0,nm0000001,Fred Astaire,1899.0,1987.0,"actor,miscellaneous,producer","tt0072308,tt0050419,tt0053137,tt0027125"
1,nm0000002,Lauren Bacall,1924.0,2014.0,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934.0,NaN,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
3,nm0000004,John Belushi,1949.0,1982.0,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918.0,2007.0,"writer,director,actor","tt0050986,tt0083922,tt0050976,tt0069467"

In [5]:
# go over title_basics
pd.read_sql_query("SELECT * FROM title_basics;", conn)

C:\Users\Dave\AppData\Local\Temp\ipykernel_4324\695836583.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM title_basics;", conn)

,tconst,titletype,primarytitle,originaltitle,isadult,startyear,endyear,runtimeminutes,genres
0,tt0000001,short,Carmencita,Carmencita,0.0,1894.0,NaN,1.0,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0.0,1892.0,NaN,5.0,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0.0,1892.0,NaN,5.0,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0.0,1892.0,NaN,12.0,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0.0,1893.0,NaN,1.0,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...
11059685,tt9916848,tvEpisode,Episode #3.17,Episode #3.17,0.0,2009.0,NaN,NaN,"Action,Drama,Family"
11059686,tt9916850,tvEpisode,Episode #3.19,Episode #3.19,0.0,2010.0,NaN,NaN,"Action,Drama,Family"
11059687,tt9916852,tvEpisode,Episode #3.20,Episode #3.20,0.0,2010.0,NaN,NaN,"Action,Drama,Family"
11059688,tt9916856,short,The Wind,The Wind,0.0,2015.0,NaN,27.0,Short
11059689,tt9916880,tvEpisode,Horrid Henry Knows It All,Horrid Henry Knows It All,0.0,2014.0,NaN,10.0,"Adventure,Animation,Comedy"

In [5]:
# go over title_principals
pd.read_sql_query("SELECT * FROM title_principals LIMIT 5;", conn)

C:\Users\Dave\AppData\Local\Temp\ipykernel_4660\2796747655.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM title_principals LIMIT 5;", conn)

,index,tconst,ordering,nconst,category,job,characters
0,0,tt0000001,1,nm1588970,self,None,"[""Self""]"
1,1,tt0000001,2,nm0005690,director,None,None
2,2,tt0000001,3,nm0005690,producer,producer,None
3,3,tt0000001,4,nm0374658,cinematographer,director of photography,None
4,4,tt0000002,1,nm0721526,director,None,None

In [6]:
# go over title_ratings
pd.read_sql_query("SELECT * FROM title_ratings LIMIT 5;", conn)

C:\Users\Dave\AppData\Local\Temp\ipykernel_4660\614666534.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM title_ratings LIMIT 5;", conn)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2082
1  tt0000002            5.6       280
2  tt0000003            6.5      2081
3  tt0000004            5.4       181
4  tt0000005            6.2      2819

In [7]:
# go over title_akas
pd.read_sql_query("SELECT * FROM title_akas LIMIT 5;", conn)

C:\Users\Dave\AppData\Local\Temp\ipykernel_4660\1213210789.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM title_akas LIMIT 5;", conn)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Carmencita,None,None,original,None,1
1,tt0000001,2,Carmencita,DE,None,None,literal title,0
2,tt0000001,3,Carmencita,US,None,imdbDisplay,None,0
3,tt0000001,4,Carmencita - spanyol tánc,HU,None,imdbDisplay,None,0
4,tt0000001,5,Καρμενσίτα,GR,None,imdbDisplay,None,0

In [8]:
# go over title_crew
pd.read_sql_query("SELECT * FROM title_crew LIMIT 5;", conn)

C:\Users\Dave\AppData\Local\Temp\ipykernel_4660\1660294661.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM title_crew LIMIT 5;", conn)

      tconst  directors writers
0  tt0000001  nm0005690    None
1  tt0000002  nm0721526    None
2  tt0000003  nm0721526    None
3  tt0000004  nm0721526    None
4  tt0000005  nm0005690    None

In [6]:
# go over title_episode
pd.read_sql_query("SELECT * FROM title_episode LIMIT 5;", conn)

C:\Users\Dave\AppData\Local\Temp\ipykernel_4324\3704316954.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM title_episode LIMIT 5;", conn)

      tconst parenttconst  seasonnumber  episodenumber
0  tt0031458   tt32857063           NaN            NaN
1  tt0041951    tt0041038           1.0            9.0
2  tt0042816    tt0989125           1.0           17.0
3  tt0042889    tt0989125           NaN            NaN
4  tt0043426    tt0040051           3.0           42.0

In [7]:
# make a function that takes a string as an input and returns a dataframe with every matching row from name_basics so we can get the right nconst
# the string matching should be case insensitive
def search_name_basics(name):
    return pd.read_sql_query("SELECT * FROM name_basics WHERE primaryname ILIKE '%{}%';".format(name), conn)

In [116]:
# pandas max row display to none
pd.set_option('display.max_rows', None)

In [129]:
# test the function
searchname = "Sean Penn"
possible_names = search_name_basics(searchname)
possible_names.head(possible_names.shape[0])

C:\Users\Dave\AppData\Local\Temp\ipykernel_4324\4111255999.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql_query("SELECT * FROM name_basics WHERE primaryname ILIKE '%{}%';".format(name), conn)

,nconst,primaryname,birthyear,deathyear,primaryprofession,knownfortitles
0,nm0000576,Sean Penn,1960.0,None,"actor,producer,director","tt0327056,tt0315733,tt1013753,tt0112818"
1,nm14073530,Sean Penny,NaN,None,None,None
2,nm2206158,Sean Penn,NaN,None,"actor,miscellaneous",tt0418627
3,nm3591268,Sean Penney,NaN,None,miscellaneous,tt1458405
4,nm6265223,Sean Penney,NaN,None,actor,tt5277030
5,nm6351863,Sean Pennington,NaN,None,actor,tt0876219
6,nm3218139,Sean Penn,NaN,None,miscellaneous,tt0486531
7,nm6665981,Sean Penning,NaN,None,actor,tt3901488
8,nm9409968,Sean Pennington,NaN,None,miscellaneous,tt7228158
9,nm1250219,Sean Penney,NaN,None,"producer,writer","tt10267606,tt2022535,tt0301792,tt0473300"
10,nm12614040,Sean Pennington,NaN,None,None,tt1334307
11,nm13708427,Sean Pennpal,NaN,None,None,None
12,nm4206918,Sean Penny,NaN,None,composer,tt1787723
13,nm4539121,Sean Pennington,NaN,None,producer,tt1954839
14,nm6628715,Sean Penn,NaN,None,None,None

In [130]:
correct_row = 0

# get nconst from row 0
nconst = possible_names.iloc[correct_row]["nconst"]
print(nconst)

# get a list of every acting movie credit where Tom Cruise also has an acting credit, and join with names_basics to get the name of the costar
#tc_costars = pd.read_sql_query("SELECT * FROM title_principals WHERE tconst IN (SELECT tconst FROM title_principals WHERE nconst = '{}' AND (category = 'actor' OR category = 'actress')) AND (category = 'actor' OR category = 'actress') AND nconst != '{}'".format(nconst, nconst), conn)
#tc_costars = tc_costars.merge(pd.read_sql_query("SELECT * FROM name_basics;", conn), on="nconst")
#tc_costars = tc_costars.merge(pd.read_sql_query("SELECT * FROM title_basics;", conn), on="tconst")
#tc_costars = tc_costars.merge(pd.read_sql_query("SELECT * FROM title_ratings;", conn), on="tconst")

query = """
    SELECT tp1.tconst, tp1.nconst, nb.primaryname, tb.primarytitle, tr.averagerating, tr.numvotes, tb.titletype, tb.startyear, tb.runtimeminutes, tb.genres, tb.isadult, tb.endyear
    FROM title_principals tp1
    JOIN title_principals tp2 ON tp1.tconst = tp2.tconst
    JOIN name_basics nb ON tp1.nconst = nb.nconst
    JOIN title_basics tb ON tp1.tconst = tb.tconst
    LEFT JOIN title_ratings tr ON tp1.tconst = tr.tconst
    WHERE tp2.nconst = %s 
      AND (tp2.category = 'actor' OR tp2.category = 'actress') 
      AND (tp1.category = 'actor' OR tp1.category = 'actress') 
      AND tp1.nconst != %s
"""
tc_costars = pd.read_sql_query(query, conn, params=[nconst, nconst])


# eliminate any rows with duplicated tconst, nconst pairs (movies where the actor played multiple roles)
tc_costars = tc_costars.drop_duplicates(subset=["tconst", "nconst"])

# keep only rows where titletype is movie
tc_costars = tc_costars[tc_costars["titletype"] == "movie"]

# for every unique value in the nconst column, get the number of times it appears in tc_costars
tc_costars["nconst"].value_counts()

# get list of nconsts in order of how many times they appear in tc_costars
stars_ordered = tc_costars["nconst"].value_counts().index

# for each nconst in stars_ordered, get the primaryname from name_basics and append to a list
star_names = []
for star in stars_ordered:
    star_names.append(pd.read_sql_query("SELECT primaryname FROM name_basics WHERE nconst = '{}';".format(star), conn).iloc[0]["primaryname"])

# make a dataframe from the list
star_names_df = pd.DataFrame(star_names, columns=["Name"])
# add the counts to the dataframe
star_names_df["Count"] = tc_costars["nconst"].value_counts().values
star_names_df.head(50)

nm0000576

C:\Users\Dave\AppData\Local\Temp\ipykernel_4324\3641792894.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tc_costars = pd.read_sql_query(query, conn, params=[nconst, nconst])
C:\Users\Dave\AppData\Local\Temp\ipykernel_4324\3641792894.py:43: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  star_names.append(pd.read_sql_query("SELECT primaryname FROM name_basics WHERE nconst = '{}';".format(star), conn).iloc[0]["primaryname"])

                   Name  Count
0          Robin Wright      5
1            Nick Nolte      3
2           Naomi Watts      3
3        John C. Reilly      3
4         James Rebhorn      2
5     Mark Boone Junior      2
6          Tye Sheridan      2
7      Catherine Keener      2
8         Wallace Shawn      2
9           Don Cheadle      2
10       Robert De Niro      2
11       Timothy Hutton      2
12       Richard Schiff      2
13     Margo Martindale      2
14      Michael Wincott      2
15        John Turturro      2
16            R.D. Call      2
17         Eddie Marsan      2
18     James Gandolfini      2
19           Alana Haim      2
20          Josh Brolin      2
21     Benicio Del Toro      2
22        Clyde Kusatsu      2
23       John Leguizamo      2
24         Leila George      1
25   Marcos A. Gonzalez      1
26           Zola Lloyd      1
27       Shannon Gannon      1
28     Gbenga Akinnagbe      1
29         Michael Pitt      1
30  Katherine Waterston      1
31           Mike Tyson      1
32          Raquel Nave      1
33            Kali Reis      1
34         Ramon Aleman      1
35         Jagan Badvel      1
36       Camila Morrone      1
37        Ray Nicholson      1
38         Clancy Brown      1
39            Erik King      1
40        Jack Gwaltney      1
41          Ving Rhames      1
42           Dan Martin      1
43            Ed Harris      1
44          Gary Oldman      1
45        Joe Viterelli      1
46     Burgess Meredith      1
47    Deirdre O'Connell      1
48       Susan Sarandon      1
49        Robert Prosky      1

In [131]:
# show the rows of tc_costars dataframe where primaryname column is Timothy Olyphant
to = tc_costars[tc_costars["primaryname"] == "Robin Wright"]
#to = to.merge(pd.read_sql_query("SELECT * FROM title_basics;", conn), on="tconst")
to.head(to.shape[0])

,tconst,nconst,primaryname,primarytitle,averagerating,numvotes,titletype,startyear,runtimeminutes,genres,isadult,endyear
29,tt0100685,nm0000705,Robin Wright,State of Grace,7.2,25299.0,movie,1990.0,134.0,"Action,Crime,Drama",0.0,NaN
332,tt0486674,nm0000705,Robin Wright,What Just Happened,5.6,28681.0,movie,2008.0,104.0,"Comedy,Drama",0.0,NaN
438,tt0119336,nm0000705,Robin Wright,Hurlyburly,5.8,10540.0,movie,1998.0,122.0,"Comedy,Drama",0.0,NaN
445,tt0119581,nm0000705,Robin Wright,Loved,4.7,753.0,movie,1997.0,109.0,"Drama,Thriller",0.0,NaN
454,tt0120112,nm0000705,Robin Wright,She's So Lovely,5.9,8808.0,movie,1997.0,100.0,"Drama,Romance",0.0,NaN